In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [2]:
df = pd.read_excel('RiskSpanSkillsAssessment.xlsx','Data')

In [3]:
# For creating first statistical report we need to select 'LENDER_INST_TYPE_DESCRIPTION' ,'loan_number','current_balanace'column
inst = df[['LENDER_INST_TYPE_DESCRIPTION','LOAN_NUMBER','CURRENT_BALANCE']]

In [4]:
inst.head()

             LENDER_INST_TYPE_DESCRIPTION  LOAN_NUMBER  CURRENT_BALANCE
0  Bank Owned Mortgage Company - National     19457569           247050
1  Bank Owned Mortgage Company - National     16864087           119000
2            Mortgage Banker - Bank Owned     17137579           315000
3            Mortgage Banker - Bank Owned     20382551           303050
4               Mortgage Banker - (Large)     23078618           120000

In [5]:
inst.rename(columns={'LENDER_INST_TYPE_DESCRIPTION':'Institution types'},inplace=True)

/usr/local/lib/python3.6/dist-packages/pandas/core/frame.py:4308: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  errors=errors,

In [6]:
inst.head()

                        Institution types  LOAN_NUMBER  CURRENT_BALANCE
0  Bank Owned Mortgage Company - National     19457569           247050
1  Bank Owned Mortgage Company - National     16864087           119000
2            Mortgage Banker - Bank Owned     17137579           315000
3            Mortgage Banker - Bank Owned     20382551           303050
4               Mortgage Banker - (Large)     23078618           120000

In [7]:
output = inst.groupby('Institution types').agg(LOAN_COUNT=('LOAN_NUMBER','nunique'),Average_current_balance=('CURRENT_BALANCE','mean'),max_current_balance=('CURRENT_BALANCE','max'),min_current_balance=('CURRENT_BALANCE','min'))

In [8]:
output.at['Total','LOAN_COUNT'] = output['LOAN_COUNT'].sum()

In [9]:
output.at['Total','Average_current_balance'] = output['Average_current_balance'].sum()

In [10]:
output.at['Total','max_current_balance'] = output['max_current_balance'].sum()

In [11]:
output.at['Total','min_current_balance'] = output['min_current_balance'].sum()

In [12]:
output

                                        LOAN_COUNT  ...  min_current_balance
Institution types                                   ...
Bank Owned Mortgage Company - National       187.0  ...              43225.0
Community Banks                              499.0  ...              28500.0
Credit Unions                                374.0  ...              22500.0
Mortgage Banker - (Large)                    279.0  ...              59000.0
Mortgage Banker - Bank Owned                 661.0  ...              25018.0
Total                                       2000.0  ...             178243.0

[6 rows x 4 columns]

In [13]:
#output.to_csv('Report1.csv')

In [14]:
# For creating the second Statistical report 
LTV = df[['LTV','LOAN_NUMBER','CURRENT_BALANCE']]

In [15]:
LTV.head()

         LTV  LOAN_NUMBER  CURRENT_BALANCE
0  90.000000     19457569           247050
1  85.000000     16864087           119000
2  90.000000     17137579           315000
3  95.000000     20382551           303050
4  84.510002     23078618           120000

In [16]:
conditions = [
    (LTV['LTV'] <= 85.000000),
    (LTV['LTV'] > 85.000000) & (LTV['LTV'] <= 90.000000),
    (LTV['LTV'] > 90.000000) & (LTV['LTV'] <= 95.000000),
    (LTV['LTV'] > 95.000000)
    ]

# create a list of the values we want to assign for each condition
values = ['(<=85)', '(>85 & <=90)', '(>90 & <=95)', '(>95)']

# create a new column and use np.select to assign values to it using our lists as arguments
LTV['Loan_to_value_cohorts'] = np.select(conditions, values)

# display updated DataFrame
LTV.head()

/usr/local/lib/python3.6/dist-packages/ipykernel_launcher.py:12: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  if sys.path[0] == '':

         LTV  LOAN_NUMBER  CURRENT_BALANCE Loan_to_value_cohorts
0  90.000000     19457569           247050          (>85 & <=90)
1  85.000000     16864087           119000                (<=85)
2  90.000000     17137579           315000          (>85 & <=90)
3  95.000000     20382551           303050          (>90 & <=95)
4  84.510002     23078618           120000                (<=85)

In [18]:
output1 = LTV.groupby('Loan_to_value_cohorts').agg(LOAN_COUNT=('LOAN_NUMBER','nunique'),Average_current_balance=('CURRENT_BALANCE','mean'),max_current_balance=('CURRENT_BALANCE','max'),min_current_balance=('CURRENT_BALANCE','min'))

In [19]:
output1

                       LOAN_COUNT  ...  min_current_balance
Loan_to_value_cohorts              ...
(<=85)                        344  ...                43300
(>85 & <=90)                  823  ...                22500
(>90 & <=95)                  796  ...                28500
(>95)                          37  ...                65475

[4 rows x 4 columns]

In [20]:
output1.at['Total','LOAN_COUNT'] = output1['LOAN_COUNT'].sum()

In [21]:
output1.at['Total','Average_current_balance'] = output1['Average_current_balance'].sum()

In [22]:
output1.at['Total','max_current_balance'] = output1['max_current_balance'].sum()

In [23]:
output1.at['Total','min_current_balance'] = output1['min_current_balance'].sum()

In [24]:
output1

                       LOAN_COUNT  ...  min_current_balance
Loan_to_value_cohorts              ...
(<=85)                      344.0  ...              43300.0
(>85 & <=90)                823.0  ...              22500.0
(>90 & <=95)                796.0  ...              28500.0
(>95)                        37.0  ...              65475.0
Total                      2000.0  ...             159775.0

[5 rows x 4 columns]

In [25]:
#output1.to_csv('Report2.csv')

In [26]:
# Statistical report 3

LAC = df[['START_DATE','LOAN_ORIG_DATE','LOAN_NUMBER','CURRENT_BALANCE']]

In [27]:
LAC.head()

  START_DATE LOAN_ORIG_DATE  LOAN_NUMBER  CURRENT_BALANCE
0 2013-06-01     2010-08-24     19457569           247050
1 2013-06-01     2011-10-26     16864087           119000
2 2013-06-01     2012-04-30     17137579           315000
3 2013-06-01     2012-07-18     20382551           303050
4 2013-06-01     2012-05-15     23078618           120000

In [28]:
LAC['difference'] = LAC['START_DATE']-LAC['LOAN_ORIG_DATE']
LAC['difference'] = LAC['difference']/np.timedelta64(1,'M')

/usr/local/lib/python3.6/dist-packages/ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.
/usr/local/lib/python3.6/dist-packages/ipykernel_launcher.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

In [29]:
LAC['difference']=LAC['difference'].round()

/usr/local/lib/python3.6/dist-packages/ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

In [30]:
# They wont be case unknown because we are giving a conditon >=40 where all the remaining values assigned to >=40 months
conditions = [
              (LAC['difference'] !=0.0 ) & (LAC['difference'] <=0.0),
    
    (LAC['difference'] >= 0.0) & (LAC['difference'] <=9.0),
    (LAC['difference'] >= 10.0) & (LAC['difference'] <= 19.0),
    (LAC['difference'] >= 20.0) & (LAC['difference'] <= 29.0),
    (LAC['difference'] >= 30.0) & (LAC['difference'] <= 39.0),
    (LAC['difference'] >=40.0)
    ]

# create a list of the values we want to assign for each condition
values = ['unknown','0-9 months', '10-19 months', '20-29 months','30-39 months','>=40 months']

# create a new column and use np.select to assign values to it using our lists as arguments
LAC['loan_age_cohorts'] = np.select(conditions, values)

# display updated DataFrame
LAC.head()

/usr/local/lib/python3.6/dist-packages/ipykernel_launcher.py:16: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  app.launch_new_instance()

  START_DATE LOAN_ORIG_DATE  ...  difference  loan_age_cohorts
0 2013-06-01     2010-08-24  ...        33.0      30-39 months
1 2013-06-01     2011-10-26  ...        19.0      10-19 months
2 2013-06-01     2012-04-30  ...        13.0      10-19 months
3 2013-06-01     2012-07-18  ...        10.0      10-19 months
4 2013-06-01     2012-05-15  ...        13.0      10-19 months

[5 rows x 6 columns]

In [31]:
output2 = LAC.groupby('loan_age_cohorts').agg(LOAN_COUNT=('LOAN_NUMBER','nunique'),Average_current_balance=('CURRENT_BALANCE','mean'),max_current_balance=('CURRENT_BALANCE','max'),min_current_balance=('CURRENT_BALANCE','min'))

In [32]:
output2.head()

                  LOAN_COUNT  ...  min_current_balance
loan_age_cohorts              ...
0                         16  ...                88065
0-9 months               286  ...                45000
10-19 months             738  ...                25018
20-29 months             535  ...                22500
30-39 months             253  ...                41705

[5 rows x 4 columns]

In [33]:
output2.at['Total','LOAN_COUNT'] = output2['LOAN_COUNT'].sum()

In [34]:
output2.at['Total','Average_current_balance'] = output2['Average_current_balance'].sum()

In [35]:
output2.at['Total','max_current_balance'] = output2['max_current_balance'].sum()

In [36]:

output2.at['Total','min_current_balance'] = output2['min_current_balance'].sum()

In [37]:
output2

                  LOAN_COUNT  ...  min_current_balance
loan_age_cohorts              ...
0                       16.0  ...              88065.0
0-9 months             286.0  ...              45000.0
10-19 months           738.0  ...              25018.0
20-29 months           535.0  ...              22500.0
30-39 months           253.0  ...              41705.0
>=40 months            172.0  ...              35000.0
Total                 2000.0  ...             257288.0

[7 rows x 4 columns]

In [39]:
output2.to_csv('Report3.csv')